controllers/SoftwaresToolsController.php

    public function actionIndex()
    {
        if(ShopUsers::is_buyer() && ShopUsers::is_LoggedIn()){
            $query =  SoftwaresTools::find()
                ->all();
            return $this->render('buyer_index',[
                'model'=>$query,
            ]);

        }else if(ShopUsers::is_LoggedIn() && ShopUsers::is_admin()) {
            $searchModel = new SoftwaresToolsSearch();
            $dataProvider = $searchModel->search($this->request->queryParams);

            return $this->render('index', [
                'searchModel' => $searchModel,
                'dataProvider' => $dataProvider,
            ]);
        }elseif(ShopUsers::is_LoggedIn() && ShopUsers::is_seller()) {
            $query =  SoftwaresTools::find()
                ->all();
---
SELECT * FROM `softwares_tools`