controllers/ToolsLicenseController.php

SELECT * FROM `tools_license` WHERE (`user_name`='buyer@gmail.com') AND (`seller_email`='help.alizain@gmail.com') AND (`shop_name`='localhost')
---
    public function actionIndex(){
            if(ShopUsers::is_LoggedIn() && ShopUsers::is_buyer()){
                $model = ToolsLicense::find()
                    ->where(['user_name'=>\Yii::$app->session->get('buyer_email')])
                    ->andWhere(['seller_email'=>\Yii::$app->params['seller_email']])
                    ->andWhere(['shop_name'=>$_SERVER['SERVER_NAME']])
                    ->all();