models/WebUsersBalance.php

SELECT sum(amount) AS `amount` FROM `web_users_balance` WHERE `username`='buyer'
---
    public static function check_balance()
    {

        $query = WebUsersBalance::find()
            ->select("sum(amount) as amount")
            ->where(['username' => Yii::$app->session->get("buyer_username")])
            ->one();